software/projects/mirth-deploy/src/test/resources/payloads_adverseevent/UpdateAEInvalidOutComeEnumType.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:mes="http://caXchange.nci.nih.gov/messaging">
	<soapenv:Header />
	<soapenv:Body>
		<mes:caXchangeRequestMessage>
			<mes:metadata>
				<mes:transactionControl>?</mes:transactionControl>
				<mes:serviceType>iHub</mes:serviceType>
				<!--Optional: -->
				<mes:operationName>Update Adverse Event</mes:operationName>
				<mes:externalIdentifier>32225879</mes:externalIdentifier>
				<!--Optional: -->
				<mes:caXchangeIdentifier />
				<!--Optional: -->
				<mes:credentials>
					<!--You have a CHOICE of the next 3 items at this level -->
					<mes:userName>tolvenuser</mes:userName>
					<mes:groupName>nogrid</mes:groupName>
					<mes:gridIdentifier>nogrid</mes:gridIdentifier>
					<!--Optional: -->
					<mes:password>changeme</mes:password>
					<!--Optional: -->
					<mes:delegatedCredentialReference>nocredentials</mes:delegatedCredentialReference>
				</mes:credentials>
			</mes:metadata>
			<mes:request>
				<mes:businessMessagePayload>
					<mes:xmlSchemaDefinition>urn:tolven-org:trim:4.0</mes:xmlSchemaDefinition>
					<trim xmlns="urn:tolven-org:trim:4.0">
						<adverseeventinput>
							<criteria>
								<participantIdentifier>PM-113</participantIdentifier>
								<studyIdentifier>7216</studyIdentifier>
								<course>
									<startDateOfThisCourse>2012-07-12-04:00</startDateOfThisCourse>
									<endDateOfThisCourse>2012-07-15-04:00</endDateOfThisCourse>
									<treatmentType>Treatment</treatmentType>
									<treatmentAssignmentCode>TAC</treatmentAssignmentCode>
								</course>
							</criteria>
							<adverseEventsList>
								<adverseEvent>
									<verbatim>Event1 Verbatim</verbatim>
									<ctepCode>Adrenal insufficiency</ctepCode>
									<grade>3</grade>
									<startDate>2012-07-10-04:00</startDate>
									<endDate>2012-07-11-04:00</endDate>
									<expected>true</expected>
									<attributionSummary>POSSIBLE</attributionSummary>
									<outcome>
										<outComeEnumType>LIFE_THREATENING_123</outComeEnumType>
									</outcome>
									<outcome>
										<outComeEnumType>HOSPITALIZATION</outComeEnumType>
									</outcome>
								</adverseEvent>
								<adverseEvent>
									<verbatim>Event2 Verbatim</verbatim>
									<ctepCode>Aspartateamino transferase increased</ctepCode>
									<grade>4</grade>
									<startDate>2012-07-10-04:00</startDate>
									<endDate>2012-07-11-04:00</endDate>
									<expected>true</expected>
									<attributionSummary>DEFINITE</attributionSummary>
									<outcome>
										<outComeEnumType>CONGENITAL_ANOMALY</outComeEnumType>
									</outcome>
									<outcome>
										<outComeEnumType>OTHER_SERIOUS</outComeEnumType>
									</outcome>
								</adverseEvent>
							</adverseEventsList>
						</adverseeventinput>
					</trim>
				</mes:businessMessagePayload>
			</mes:request>
		</mes:caXchangeRequestMessage>
	</soapenv:Body>
</soapenv:Envelope>